blog/2014/11/03/전산학-교육에-대하여./index.html

<!DOCTYPE html>
<!--[if IEMobile 7 ]><html class="no-js iem7"><![endif]-->
<!--[if lt IE 9]><html class="no-js lte-ie8"><![endif]-->
<!--[if (gt IE 8)|(gt IEMobile 7)|!(IEMobile)|!(IE)]><!--><html class="no-js" lang="en"><!--<![endif]-->
<head>
  <meta charset="utf-8">
  <title>전산학 교육에 대하여. - sven&#8217;s blog</title>
  <meta name="author" content="sven">

  
  <meta name="description" content="Layer 어느 레이어부터 가르치던 무엇을 신뢰하고 있는지를 명확히 말할 수 있고 그 이후의 것은 쌓아올릴 수 있게.
이러면 이렇다라는 것의 나열에서 가능한 plausible explanation 을 각자 우연찮게 찾아내고 별다른 논의 없이 넘어가는 것이 정말 너무 &hellip;">
  

  <!-- http://t.co/dKP3o1e -->
  <meta name="HandheldFriendly" content="True">
  <meta name="MobileOptimized" content="320">
  <meta name="viewport" content="width=device-width, initial-scale=1">

  
  <link rel="canonical" href="http://sven--.github.io/blog/2014/11/03/%EC%A0%84%EC%82%B0%ED%95%99-%EA%B5%90%EC%9C%A1%EC%97%90-%EB%8C%80%ED%95%98%EC%97%AC.">
  <link href="/favicon.png" rel="icon">
  <link href="/stylesheets/screen.css" media="screen, projection" rel="stylesheet" type="text/css">
  <link href="/stylesheets/data-table.css" media="screen, projection" rel="stylesheet" type="text/css" />
  <link href="/stylesheets/rve-styles.css" media="screen, projection" rel="stylesheet" type="text/css" />
  <link href="/atom.xml" rel="alternate" title="sven's blog" type="application/atom+xml">
  <!--Fonts from Google"s Web font directory at http://google.com/webfonts -->
<link href="//fonts.googleapis.com/css?family=PT+Serif:regular,italic,bold,bolditalic" rel="stylesheet" type="text/css">
<link href="//fonts.googleapis.com/css?family=Open+Sans" rel="stylesheet" type="text/css">
<link href="//fonts.googleapis.com/css?family=Fjalla+One" rel="stylesheet" type="text/css">
<!--- MathJax Configuration -->
  

</head>

<body   class="collapse-sidebar sidebar-footer" >
  <header role="banner"><hgroup>
  <h1><a href="/">sven&#8217;s blog</a></h1>
  
</hgroup>

</header>
  <nav role="navigation"><ul class="subscribe" data-subscription="rss">
  <li><a href="/atom.xml" rel="subscribe-rss" title="subscribe via RSS"><svg version="1.1" xmlns="http://www.w3.org/2000/svg" xmlns:xlink="http://www.w3.org/1999/xlink" width="25" height="25" viewbox="0 0 100 100"><path class="social" d="M 13.310204,73.332654 C 5.967347,73.332654 0,79.322448 0,86.621428 c 0,7.338776 5.967347,13.262246 13.310204,13.262246 7.370408,0 13.328572,-5.92245 13.328572,-13.262246 0,-7.29898 -5.958164,-13.288774 -13.328572,-13.288774 z M 0.01530612,33.978572 V 53.143878 C 12.493878,53.143878 24.229592,58.02347 33.068368,66.865306 41.894898,75.685714 46.767346,87.47449 46.767346,100 h 19.25 C 66.017346,63.592858 36.4,33.979592 0.01530612,33.978572 l 0,0 z M 0.03877552,0 V 19.17449 C 44.54796,19.17551 80.77551,55.437756 80.77551,100 H 100 C 100,44.87653 55.15102,0 0.03877552,0 z"></path></svg></a></li>
  
</ul>
  
  
  
  
  
  
  
    
      <form action="https://www.google.com/search" method="get">
        <fieldset role="search">
          <input type="hidden" name="q" value="site:sven--.github.io" />
    
          <input class="search" type="text" name="q" results="0" placeholder="Search"/>
        </fieldset>
      </form>
  
<ul class="main-navigation">
  <li><a href="/">Blog</a></li>
  <li><a href="/blog/archives">Archives</a></li>
</ul>

</nav>
  <div id="main">
    <div id="content">
      <div>
<article class="hentry" role="article">
  
  <header>
    
      
        <h1 class="entry-title">전산학 교육에 대하여.</h1>
      
    
    
      <p class="meta">
        




<time class='entry-date' datetime='2014-11-03'><span class='date'><span class='date-month'>Nov</span> <span class='date-day'>3</span><span class='date-suffix'>rd</span>, <span class='date-year'>2014</span></span> <span class='time'>12:00 am</span></time>
        
        
      </p>
    
  </header>


<div class="entry-content"><div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1">Layer</h2>
<div class="outline-text-2" id="text-1">
<p>
어느 레이어부터 가르치던 무엇을 신뢰하고 있는지를 명확히 말할 수 있고 그 이후의 것은 쌓아올릴 수 있게.
이러면 이렇다라는 것의 나열에서 가능한 plausible explanation 을 각자 우연찮게 찾아내고 별다른 논의 없이 넘어가는 것이 정말 너무 싫다.
C 의 좋은 교육은 언어 자체의 BNF 를 포함해서 양이 많으니까 초심자에게는 어려울 것 같고, 
그것보다 scheme 같은 거에서 정의해서 쌓아올리는게 본질적으로 같으면서 양도 적고 직관적이고 흥미롭지 않나.
</p>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2">induction, deduction</h2>
<div class="outline-text-2" id="text-2">
<ul class="org-ul">
<li>induction : 과학
</li>
<li>deduction : 수학
</li>
<li>CS?
</li>
</ul>
<p>
세포 하나하나는 deductive reasoning 인데 결국 생명체 레벨에서는 inductive reasoning 을 쓰게 되는 것은 뭐 현실적인 한계로 어쩔 수 없다고 쳐도 세포를 공부할 때는 그에 맞는 방법을 쓸 수 있지 않나. 
그리고 앞의 &#8220;현실적인 한계&#8221;라는 것도 점점 부숴나가야 하는 것. 
소프트웨어 테스팅이 induction 이라면 (에러가 안잡혔으니 대충 맞지 않을까) 
컴파일러 정형 검증 같은 것은 deduction 
(맞다. 아니면 논리학이 틀렸거나, coq 의 작은 핵심 엔진을 검증한 사람들이 우연의 일치로 모두 한결같이 바보거나 (de bruijn criterion), 전자과에서 0/1 구분을 잘 못해줬거나, os 가 잘못됬거나 등등 뭐 많긴 하지만 종국에 검증 가능한 문제들을 빼고 인간끼리 합의가 필요한 부분은 굉장히 적어짐)
</p>

<p>
<!-- more -->
</p>
</div>
</div>
</div>


  <footer>
    <p class="meta">
      
  



  <span class="byline author vcard">Authored by <span class="fn">
  
    sven
  
  </span></span>


      




<time class='entry-date' datetime='2014-11-03'><span class='date'><span class='date-month'>Nov</span> <span class='date-day'>3</span><span class='date-suffix'>rd</span>, <span class='date-year'>2014</span></span> <span class='time'>12:00 am</span></time>
      
      

<span class="categories">
  
    <a class='category' href='/blog/categories/saenggag/'>생각</a>
  
</span>


    </p>
    
      <div class="sharing">
  
  <a href="//twitter.com/share" class="twitter-share-button" data-url="http://sven--.github.io/blog/2014/11/03/%EC%A0%84%EC%82%B0%ED%95%99-%EA%B5%90%EC%9C%A1%EC%97%90-%EB%8C%80%ED%95%98%EC%97%AC./" data-via="" data-counturl="http://sven--.github.io/blog/2014/11/03/%EC%A0%84%EC%82%B0%ED%95%99-%EA%B5%90%EC%9C%A1%EC%97%90-%EB%8C%80%ED%95%98%EC%97%AC./" >Tweet</a>
  
  
  
</div>

    
    <p class="meta">
      
        <a class="basic-alignment left" href="/blog/2014/11/02/yea!-i'm-pikachu!/" title="Previous Post: Yea! I'm Pikachu!">&laquo; Yea! I&#8217;m Pikachu!</a>
      
      
    </p>
  </footer>
</article>


</div>

    </div>
  </div>
  <footer role="contentinfo"><p>
  Copyright &copy; 2014 - sven -
  <span class="credit">Powered by <a href="http://octopress.org">Octopress</a> | Themed with <a href="https://github.com/lucaslew/whitespace">Whitespace</a></span>
</p>

</footer>
  










  <script type="text/javascript">
    (function(){
      var twitterWidgets = document.createElement('script');
      twitterWidgets.type = 'text/javascript';
      twitterWidgets.async = true;
      twitterWidgets.src = '//platform.twitter.com/widgets.js';
      document.getElementsByTagName('head')[0].appendChild(twitterWidgets);
    })();
  </script>





</body>
</html>
